
import * as React from "react";
import "./SomeServices.css"
import { FontAwesomeIcon } from '@fortawesome/react-fontawesome';
import { faBalanceScale, faBuilding, faBusinessTime, faFileContract, faGavel, faMask, faUserPlus, faUsers } from '@fortawesome/free-solid-svg-icons';
export default function SomeServices() {
    let services = [
        { id: 1, name: "تأسيس الشركات", title: "تأسيس الشركات", image: "", body: "لدى شركة رواد الحكمة خبرة طويلة في مجال تأسيس الشركات التجارية المحلية والمختلطة بمختلف أنواعها ( المساهمة – المحدودة – التضامنية – التوصية البسيطة – القابضة... الخ ) وما يطرأ عليها من تعديلات وتصفية الشركات - تسجيل العلامات التجارية – تسجيل الوكالات التجارية – استخراج السجلات التجارية والقيام بتعديلاتها – تحويل المؤسسات الفردية إلي شركات – إعداد اللوائح العمالية الداخلية والمهام الوظيفية للشركات والمؤسسات – وضع الأنظمة والمواثيق التي تحافظ على حماية واستقرار الشركات العائلية ( من الأزمات ) – تولي مهام التحكيم في المنازعات التجارية – استصدار تراخيص وسجلات الشركات الأجنبية والمختلطة من الهيئة العامة للاستثمار" },
        { id: 2, name: "صياغة وتدقيق كافة العقود ", title: "صياغة وتدقيق  كافة العقود", image: "", body: "العقود من أهم مصادر الالتزام في التعاملات اليومية بين أفراد المجتمع فيما بينهم أو بين أفراد المجتمع ومؤسساته العامة أو الخاصة أو بين مؤسسات المجتمع العامة والخاصة فيما بينها، وحيث إن الفرد منا في حياته اليومية يبرم العديد من العقود (دون وعي منه بأهميتها والآثار المترتبة عليها) لذا ينبغي عليه المعرفة والعلم بشروط العقود التي أبرمها والالتزامات المترتبة عليها. وللعقد تعريفات كثيرة سواء في الفقه الإسلامي أو عند القانونيين ومنها العقد وهو الربط ويعرف أيضاً بالعهد والميثاق وقد عرفه الفقه الإسلامي: بأنه تلاقي إرادتين أو أكثر على إحداث التزام محدد والوفاء به، كما عرفه القانونيون بأنه توافق إرادتين أو أكثر على إحداث أثر قانوني أو نقله. وقد جاءت الآيات القرآنية الدالة على أهمية العقود وتوثيقها قال الله تعالى ((يَا أَيُّهَا الَّذِينَ آَمَنُوا أَوْفُوا بِالْعُقُودِ))، وقوله تعالى ((يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَدَايَنْتُمْ بِدَيْنٍ إِلَى أَجَلٍ مُسَمًّى فَاكْتُبُوهُ)) وكما قال الرسول صلى الله عليه وسلم (المسلمون على شروطهم) ، وتبرز أهمية العقد في حفظ الحقوق والالتزامات وتوثيقها بين المتعاقدين، والتوثيق لا ينافي الثقة وهو سبيل للتقليل من منع نشوب نزاع بين أطراف العقد، وضبط العلاقة بينهما ويسهل على القاضي في حال نشوب نزاع بين أطرافه الرجوع إلى أحكامه وشروطه وتفسيرها فيما يتفق مع الشرع والنظام والحكم بموجبهما كما أنه ينبغي التركيز على حسن صياغة العقد، فالصياغة هي التعبير عما يريده أطراف العقد، ويجب على من يقوم بعملية صياغة العقد أن يراعي عدة أمور من أهمها المقدمة في العقد، بحيث يجب أن تشتمل المقدمة على تاريخ إنشاء العقد، أسماء الأطراف وبياناتهم، عناوينهم، جميع معلوماتهم الضرورية، الهدف من العقد، كما يجب أن يشتمل العقد على تحديد التزامات وواجبات أطراف العقد والغرض ونوع العقد ومدته وقيمته وطريقة الدفع والشروط الجزائية، وآلية الفسخ وطريقة حل المنازعات وتحديد الجهة المختصة عند نشوب النزاع والقانون الواجب التطبيق والسرية وعدم الإفشاء تفاصيل وبنود العقد، والإشارة إلى مرفقات العقد ومستنداته (إن وجدت) وأن يقوم أطراف العقد بالتأشير على جميع أوراق العقد والتوقيع في الصفحة الختامية للعقد. ومن المهارات اللازمة لصياغة العقود أن يكون صائغ العقد على دراية واطلاع برغبات أطراف العقد وأن تكون لديه حصيلة فقهية (شرعية ونظامية ولغوية) تمكنه وتساعده على حسن الصياغة والإبداع فيه بحسب متطلبات العقد، وتجنب الصيغة التي تفضي إلى المجهول . وقد أعطت شركة رواد الحكمة صياغة العقود أولوية خاصة لما لها من دور في حفظ حقوق العملاء ويتقوم شركة رواد الحكمة  بإعداد وصياغة كافة نماذج العقود باللغة العربية وباللغة الإنجليزية سواء كانت على أوراق ومطبوعات المكتب الرسمية أو على أوراق عادية حسب رغبة العملاء ومنها على سبيل المثال : - عقود البيع. - عقود الإيجار والرهن. - عقود العمل. - كافة أنواع العقود التجارية وعقود الشركات. - العقود الإدارية . - عقود الشراكة." },
        { id: 3, name: "الاستشارات القانونية والشرعية", title: "الاستشارات  القانونية والشرعية", image: "", body: "تقدم شركة رواد الحكمة كافة الاستشارات القانونية والشرعية الشفوية والمكتوبة فالاستشارة القانونية هي استكشاف رأي النظام و الشرع في مسألة معينة أو موضوع بعينه قد تكون محل نزاع جدي أمام القضاء أو نزاع ممكن أن يقع مستقبلاً و الهدف من الاستشارة هو معرفة حكم النظام والشرع والوقوف على احتمالات صدور حكم لصالح طالب الاستشارة من عدمه ، و قد تُطلب الاستشارة بشأن مسألة معينة لا تكون محل نزاع أمام القضاء حتى يكون طالب الاستشارة على علم ودراية كاملة بنتائج تصرفه فلا يتعرض للمساءلة أو الخسارة لاحقا ومن خلال الاستشارة الصحيحة يتم سد الثغرات التي يمكن أن يستفيد منها من يتعاقد مع طالب الاستشارة ويتعامل معه ويجب أن يضع طالب الاستشارة أمام المستشار أو المحامي جميع العناصر التي تمكنه من بيان الرأي القانوني السليم ، وعلى المستشار تبيان الحكم القانوني بوضوح ودقة بالغتين لطالب الاستشارة لإحاطته علما بحقيقة المسألة والقضية، ومن أهم الاستشارات القانونية التي تقدمها شركة رواد الحكمة : - الاستشارات المتعلقة بقضايا الأحوال الشخصية ( إثبات زواج – خلع – طلاق- فسخ نكاح للضرر – نشوز- نفقة- حضانة – زيارة- إذن سفر بالمحضون ) . - الاستشارات المتعلقة بجميع أنواع العقود التجارية والإدارية ( عقد الوكالة التجارية – عقود الشراكة – جميع العقود التي تكون جهة الإدارة طرفا فيها ). - الاستشارات المتعلقة بعمل الشركات ونظامها الداخلي وعلاقاتها مع الغير ومع موظفيها . - الاستشارات المتعلقة بالقضايا الجزائية ( القتل- الحرابة- السطو- السرقة- المخدرات- الجرائم المعلوماتية- الخطف ) - الاستشارات التأمينية . - الاستشارات التي تتعلق بنظام الخدمة العسكرية ونظام الخدمة المدنية ونظام خدمة الأفراد . - الاستشارات المتعلقة بتأسيس الشركات وتصفيتها . وتقدم شركة رواد الحكمة تلك الاستشارات بمنهجية كاملة عبر ثلاث مراحل :- المقدمة التحليل الخاتمة في تلك المرحلة يحدد المستشار بدقة إطار الاستشارة والنقاط التي تثيرها فيذكر الوقائع المطروحة من طالب الاستشارة مرتبة ومنظمة لأن طالب الاستشارة قد يقدمها له بشكل غير منظم حتى يتمكن المستشار من الوقوف على الإشكالات القانونية التي سيتطرق لها فيما بعد في مرحلة التحليل. -التحليل بعد ضبط نطاق الوقائع تأتى مرحلة التحليل وهي أهم مرحلة في الاستشارة القانونية، إذا يقوم فيها المستشار أو المحامي بالعمليات التالية :- - تحديد الإشكالية أو الإشكالات القانونية المطروحة. - المناقشة - إعطاء الرأي القانوني بشأن المسائل والقضايا القانونية المطروحة : الإشكالات القانونية يستنتجها المستشار من الوقائع والمعلومات المحددة في الاستشارة و في بعض الأحيان قد يطرح طالب الاستشارة على المستشار سؤال أو عدة أسئلة، حينها يمكن للمستشار أن يقف على الأسئلة المطروحة عليه، أما إذا كانت هذه الأسئلة غير كافية، فإن المستشار يستخلص الإشكالات الجوهرية المترتبة على الوقائع المطروحة أو الإشكالات المتفرعة عنها وأحيانا قد تكون الوقائع المقدمة من طالب الاستشارة غير دقيقة وغير كافية، فيستوجب على المستشار في هذه الحالة أيضا أن يبن النقص الملاحظ بخصوصها ، وأثناء المناقشة وتبيان الحكم القانوني يتقيد المستشار بالقواعد النظامية والقانونية ويستوجب على المستشار أن يرجع إلى النصوص الشرعية التي تنطبق على المسألة أو القضية القانونية المطروحة، ويلتزم بحكم النص النظامي الصريح إن كان واضحا لا لبس فيه ، وإن كان النص النظامي غامضا فسره بما يفسره القضاء والفقه، ويتطرق المستشار إلى الاجتهاد القضائي المتعلق بالقضية المطروحة، خاصة الاجتهاد القضائي المستقر عليه، كما يذكر الآراء الفقهية دون الخوض في تفصيلاتها وذكر النظريات كما يبين الخلاف الحاصل بين القضاء والفقه إن كان ثمة خلاف حول القاعدة القانونية مع تبيان الراجح منها. - الخاتمة في النهاية يقدم المستشار خلاصة رأيه القانوني في المسألة بصورة موجزة ومختصرة ومركزة وبوضوح تام ليعتمد عليها طالب الاستشارة فيما بعد حتى يتمكن من الاستفادة من الاستشارة على أكمل وجه ) . من خلال نخبة من أفضل المحامين والمستشارين القانونين المهرة ذو الخبرة بهذا المجال من خلال أقسام المكتب المختلفة عن طريق فروع المكتب المنتشرة بالمملكة العربية السعودية بأسرع وقت ممكن وبسرية تامة عن طريق كافة وسائل الاتصال المختلفة ." },
        { id: 4, name: "التمثيل القانوني", title: "التمثيل القانوني", image: "", body: "تتولى شركة رواد الحكمة  المرافعة والمدافعة عن العملاء وتمثيلهم لدي كافة المحاكم الشرعية – ديوان المظالم – لجنة تسوية المنازعات المصرفية – لجان مكتب العمل – لجان مكتب الفصل في منازعات الأوراق التجارية – اللجان شبة القضائية والإدارية – اللجان الجمركية – المنازعات أمام هيئة التحكيم المحلية والدولية" },
        { id: 5, name: "التجارية", title: "قضايا  التجارية وتحصيل الديون", image: "", body: "مع صدور نظام التنفيذ بالمملكة العربية السعودية خصصت شركة رواد الحكمة قسم مستقل لقضايا الأوراق التجارية ( السند لأمر – الكمبيالة – الشيك ) وتحصيل الديون يضم نخبة من أفضل المحاميين والمستشارين في قضايا الأوراق التجارية." },
        { id: 6, name: "الجنائية", title: "قضايا  الجنائية", image: "", body: "- الجرائم المعلوماتية. - قضايا المخدرات ( التعاطي والاتجار- التهريب ) . - قضايا القتل العمد وشبه العمد والشروع بالقتل. - قضايا السرقات . - قضايا الخطف. - قضايا الحرابة. - جرائم الاختلاس وخيانة الأمانة. - قضايا الاعتداء على رجال الأمن. - جرائم الضرب والجرح . - قضايا غسيل الأموال. - قضايا القذف والتهديد. - قضايا التشهير والابتزاز. قد يرتكب المتهم جريمة لأهداف مشروعة وقانونية ( الضرورات تبيح المحظورات ) دون أن يعلم هو مشروعية ذلك ، و في هذه اللحظة يتخلى عنه حتى اقرب الناس إليه ، ويكون في مواجهة إجراءات قانونية صعبة ، ووسائل إعلام لا ترحم ومن هذا المنطلق كفلت الشريعة الإسلامية والنظام لأي متهم حق الاستعانة بمحامي ، ومنذ تأسس شركة رواد الحكمة على ركيزة أساسية وهدف سامي وهو إظهار الحق وإعلاء كلمته ولذلك أخذ مكتبنا على عاتقة البحث عن الحقيقة ومحاولة إظهارها عن طريق استقطاب محامين أكفاء لديهم أهم مقومات المحامي الجنائي الناجح الذي يتقن على علم وفن المرافعة الشفوية والمكتوب فالمرافعة ليست موجه للمتهم وإنما موجهة لقاضي جنائي خبير بالقانون أودع الله في قلبه اليقين وفي عقله الفطنة للتمييز بين المدان و غيرة .فالحكم ببراءة المتهم لا يأتي من فراغ ، وإنما يقوم على قواعد تقاضي مستمدة من شريعتنا الغراء والأنظمة التي وضعها ولي الأمر عن طريق محامي خبير ملم بتلك الأمور حتى يحسن صياغة ردوده ." },
        { id: 7, name: "العمالية والادارية", title: "قضايا  العماليةوالإدارية", image: "", body: "تعد شركة رواد الحكمة من أمهر وأفضل المحامين بالمملكة العربية السعودية بقضايا الشركات فقد قام بالعديد من الأبحاث المتعلقة بعمل الشركات ومنها ( حماية شركات المساهمة من الإفلاس ، وحماية الشركات العائلية من الأزمات ) وقد لاقت تلك الأبحاث استحسان المهتمين بأنظمة الشركات ويختص مكتب المحامي علي بن فراج بقضايا الشركات الآتية:- - القضايا العمالية التي تكون الشركة طرفا فيها سواء كانت مدعية أو مدعى عليها . - القضايا المالية ومنازعات العقود المختلفة التي تكون الشركة طرفا فيها . - قضايا الغش التجاري. - القضايا الجمارك . - القضايا المتعلقة بنظام التأمينات الاجتماعية. - تأسيس الشركات بمختلف أنواعها. - تحويل المؤسسة الفردية إلى شركة. - القضايا الإدارية التي ترفع على الجهات الحكومية بمختلف أنواعها. - قضايا المنازعات التأمينية." },
        { id: 8, name: "الأحوال الشخصية", title: "قضايا الأحوال الشخصية", image: "", body: "تعد قضايا الأحوال الشخصية والأسرية وما تتضمنه من:- - قضايا الطلاق والخلع وفسخ النكاح للضرر. - قضايا النفقة . - قضايا الحضانة والزيارة. - قضايا النشوز . - قضايا إثبات الوقف والوصية والنسب والغيبة والوفاة وحصر الورثة وقسمة التركة . قضايا إثبات تعيين الأوصياء وإقامة الأولياء والنظر والإذن لهم في التصرفات التي تستوجب إذن المحكمة وعزلهم عند الاقتضاء والحجر على السفهاء ورفعه عنهم ، في بعض الأحيان هي الحل الوحيد لكافة المشاكل والمنازعات الأسرية والمشاكل بين الورثة ومن أكثر القضايا التي تستقبلها المحاكم الشرعية وتُعاني قضايا الأحوال الشخصية من الخصوم أنفسهم، ويتضح ذلك من خلال عدم الاستعانة بالمحاميين، أو عدم معرفة الأسلوب الأمثل لطلب الحقوق والتقاضي، إضافةً إلى عدم تجاوب الأطراف للدعوى، خاصةً الزوج والأهل لطلب الطلاق أو الخلع أو النفقة أو الحضانة، كذلك كشفت خصومة الأطراف عن عدم حرصهم على إنهاء الدعوى، فالملاحظ أن هناك من يحرص على إطالة أمدها بأكبر شكل بحثاً عن التأخير، وقد استقطبت شركة رواد الحكمة محامين ومستشارين ذوي خبرة في كافة قضايا الأحوال الشخصية لسرعة إنهائها وانجازها لصالح الموكل بالصورة التي ترضيه وبحمد الله أصبحت شركة رواد الحكمة من الشركات الرائدة في تلك النوعية من القضايا." },
    ]
    return (
        <>
            <div className="bg-white py-[100px]">
                <div className="container">
                    <div className="head flex gap-6 justify-between items-center flex-col-reverse md:flex-row">
                        <button className="serve-btn gap-2 flex flex-row hover:bg-[#134776] bg-[#C9A85E] p-[20px_40px] justify-between items-center">
                            <span className="block font-[300] text-white text-[18px] leading-[29px]" > عرض جميع خدماتنا</span>
                            <FontAwesomeIcon icon={faBalanceScale} className=" font-[900] text-white text-[24px] leading-[24px]" />
                        </button>
                        <h2 className=" font-[700] text-[#134776] text-[38px] leading-539px] text-center sm:text-right " >بعض خدماتنا </h2>
                    </div>
                    <div className="body flex flex-col-reverse md:flex-row border-2 border-[#ccc] justify-between items-center mt-5  sm:px-0 px-3 sm:pb-0 pb-3">
                        <div className="pt-5 sm:pt-0 w-full sm:w-2/3 flex flex-col-reverse  md:flex-row justify-end items-center sm:px-5 px-0">
                            <div className="image w-full sm:w-1/3">
                                <img src="assets/images/some_service.webp" alt="some_service" className="w-full h-full" />
                            </div>
                            <div className="text w-full sm:w-2/3 text-right ">
                                <h3 className="font-[700] text-[rgb(19,_71,_118)] text-[32px] leading-[45px] pb-5">
                                    <span className=" text-[rgb(19,_71,_118)] ">التمثيل</span>
                                    &nbsp; <span className=" text-[#C9A85E] ">القانونى</span>
                                </h3>
                                <p className="paragaph font-[300] text-[rgb(68,_68,_68)] text-[18px] leading-[29px] ">تتولى شركة رواد الحكمة  المرافعة والمدافعة عن العملاء وتمثيلهم لدي كافة المحاكم الشرعية – ديوان المظالم – لجنة تسوية المنازعات المصرفية – لجان مكتب العمل – لجان مكتب الفصل في منازعات الأوراق التجارية – اللجان شبة القضائية والإدارية – اللجان الجمركية – المنازعات أمام هيئة التحكيم المحلية والدولية
                                </p>
                            </div>


                        </div>
                        <div className="w-full sm:w-1/3 bg-[#134776]">
                            <ul className="w-full h-full">
                                <li className="p-[12px_5px] sm:p-[12px_20px] hover:bg-white text-[16px] leading-[26px] font-[400]  
                                cursor-pointer hover:text-[rgb(19,_71,_118)] text-white bg-[rgb(19,_71,_118)]
                                 flex flex-row gap-2 justify-end items-center  active">
                                    {/*  onClick={openServiceDetails('تأسيس الشركات')} */}
                                    <span className="">تأسيس الشركات</span>
                                    <FontAwesomeIcon icon={faBusinessTime} />
                                </li>


                                <li className="p-[12px_5px] sm:p-[12px_20px] hover:bg-white text-[16px] leading-[26px] font-[400]  
                                cursor-pointer hover:text-[rgb(19,_71,_118)] text-white bg-[rgb(19,_71,_118)]
                                 flex flex-row gap-2 justify-end items-center   text-right ">                                   <span className="">صياغة وتدقيق كافة العقود </span>
                                    <FontAwesomeIcon icon={faFileContract} />
                                </li>
                                <li className="p-[12px_5px] sm:p-[12px_20px] hover:bg-white text-[16px] leading-[26px] font-[400]  
                                cursor-pointer hover:text-[rgb(19,_71,_118)] text-white bg-[rgb(19,_71,_118)]
                                 flex flex-row gap-2 justify-end items-center  text-right ">                                       <span className="">الاستشارات القانونية والشرعية</span>
                                    <FontAwesomeIcon icon={faBalanceScale} />
                                </li>
                                <li className="p-[12px_5px] sm:p-[12px_20px] hover:bg-white text-[16px] leading-[26px] font-[400]  
                                cursor-pointer hover:text-[rgb(19,_71,_118)] text-white bg-[rgb(19,_71,_118)]
                                 flex flex-row gap-2 justify-end items-center  text-right ">                                      <span className="">التمثيل القانوني</span>
                                    <FontAwesomeIcon icon={faGavel} />
                                </li>
                                <li className="p-[12px_5px] sm:p-[12px_20px] hover:bg-white text-[16px] leading-[26px] font-[400]  
                                cursor-pointer hover:text-[rgb(19,_71,_118)] text-white bg-[rgb(19,_71,_118)]
                                 flex flex-row gap-2 justify-end items-center  text-right ">                                       <span className="">التجارية</span>
                                    <FontAwesomeIcon icon={faBuilding} />
                                </li>
                                <li className="p-[12px_5px] sm:p-[12px_20px] hover:bg-white text-[16px] leading-[26px] font-[400]  
                                cursor-pointer hover:text-[rgb(19,_71,_118)] text-white bg-[rgb(19,_71,_118)]
                                 flex flex-row gap-2 justify-end items-center text-right ">                                       <span className="">الجنائية</span>
                                    <FontAwesomeIcon icon={faMask} />
                                </li>
                                <li className="p-[12px_5px] sm:p-[12px_20px] hover:bg-white text-[16px] leading-[26px] font-[400]  
                                cursor-pointer hover:text-[rgb(19,_71,_118)] text-white bg-[rgb(19,_71,_118)]
                                 flex flex-row gap-2 justify-end items-center text-right ">                                      <span className=""> العمالية والادارية</span>
                                    <FontAwesomeIcon icon={faUserPlus} />
                                </li>
                                <li className="p-[12px_5px] sm:p-[12px_20px] hover:bg-white text-[16px] leading-[26px] font-[400]  
                                cursor-pointer hover:text-[rgb(19,_71,_118)] text-white bg-[rgb(19,_71,_118)]
                                 flex flex-row gap-2 justify-end items-center text-right ">                                       <span className="">الأحوال الشخصية</span>
                                    <FontAwesomeIcon icon={faUsers} />
                                </li>
                            </ul>
                        </div>
                    </div>
                </div>

            </div>
        </>
    );
}